stressTesting/artillery.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 20
      arrivalCount: 20
    # - duration: 120
    #   arrivalRate: 30
    #   rampTo: 50
    # - duration: 60
    #   arrivalRate: 30
  payload:
    path: "./locationids.csv"
    fields:
      - "locationId"
scenarios:
  - name: "Peruse location"
    flow:
    - loop:
      - get:
          url: "/images/{{location_id}}"
          count: 5